Revit 2027 API
ScheduleSheetInstance.Point Property
 Location on the sheet where the ScheduleInstance is placed (in sheet coordinates).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Point { get; set; }
Public Property Point As XYZ
	Get
	Set
public:
property XYZ^ Point {
	XYZ^ get ();
	void set (XYZ^ value);
}
member Point : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property: This operation is prohibited for ScheduleInstances associated with revision schedules in titleblocks.
See Also
Reference
ScheduleSheetInstance Class
Autodesk.Revit.DB Namespace